{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from pprint import pprint\n",
    "from py2neo import Graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph = Graph(host=\"localhost://7474\", auth=(\"neo4j\", \"123456\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"MATCH (p:Reviewer)-[w:Wrote]->(r:Review)-[a:About]->(re:Restaurant)\n",
    "RETURN p.name AS reviewer, COUNT(w) AS num_of_reviews\n",
    "ORDER BY num_of_reviews DESC LIMIT 20\"\"\"\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>num_of_reviews</th>\n",
       "      <th>reviewer</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>677</td>\n",
       "      <td>U0044</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>657</td>\n",
       "      <td>U0492</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>498</td>\n",
       "      <td>U0008</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>353</td>\n",
       "      <td>U1418</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>336</td>\n",
       "      <td>U0088</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>312</td>\n",
       "      <td>U0241</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>301</td>\n",
       "      <td>U0255</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>295</td>\n",
       "      <td>U0057</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>293</td>\n",
       "      <td>U0158</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>274</td>\n",
       "      <td>U0143</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>273</td>\n",
       "      <td>U0028</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>271</td>\n",
       "      <td>U0073</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>262</td>\n",
       "      <td>U0082</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>258</td>\n",
       "      <td>U0257</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>252</td>\n",
       "      <td>U0014</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>244</td>\n",
       "      <td>U0034</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>232</td>\n",
       "      <td>U0686</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>224</td>\n",
       "      <td>U0353</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>222</td>\n",
       "      <td>U0273</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>221</td>\n",
       "      <td>U0087</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    num_of_reviews reviewer\n",
       "0              677    U0044\n",
       "1              657    U0492\n",
       "2              498    U0008\n",
       "3              353    U1418\n",
       "4              336    U0088\n",
       "5              312    U0241\n",
       "6              301    U0255\n",
       "7              295    U0057\n",
       "8              293    U0158\n",
       "9              274    U0143\n",
       "10             273    U0028\n",
       "11             271    U0073\n",
       "12             262    U0082\n",
       "13             258    U0257\n",
       "14             252    U0014\n",
       "15             244    U0034\n",
       "16             232    U0686\n",
       "17             224    U0353\n",
       "18             222    U0273\n",
       "19             221    U0087"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Find out reviewer order by number of wrote reviews\n",
    "a = graph.run(query).to_data_frame()\n",
    "a"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['U0044', 'U0492', 'U0008', 'U1418', 'U0088', 'U0241', 'U0255', 'U0057', 'U0158', 'U0143', 'U0028', 'U0073', 'U0082', 'U0257', 'U0014', 'U0034', 'U0686', 'U0353', 'U0273', 'U0087']\n"
     ]
    }
   ],
   "source": [
    "reviewer = a['reviewer'].tolist()\n",
    "print(reviewer)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Build up recommendation engine"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Our recommendation engine will recommend restaurant to target user based on the preference of the usesr that will have a similar taste on restaurant. For each user, we will identify the most similar users to them and preferences of these simialr users are then used to generate recommendations for the target user.\n",
    "\n",
    "This algorithm is known as Collaborative Filtering.\n",
    "\n",
    "Collaborative filtering (CF) is a technique commonly used to build personalized recommendation systems. Some popular websites that use CF technology include Amazon, Netflix, and IMDB. In CF, predictions about a user's interests are made by compiling preferences from similar users.\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "The similarity metric we will use here is Jaccard Similarity Coefficient or Jaccard Index also known as Intersection over Union(IoU).\n",
    "\n",
    "<img src=\"reco_data\\IoU.jpg\">\n",
    "\n",
    "Jaccard Index between two sets A and B is the ratio of the number of elements in the intersection of A and B over the number of elements in the union of A and B.\n",
    "\n",
    "Reference: https://deepai.org/machine-learning-glossary-and-terms/jaccard-index"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Get the most similar users to our target user, the Jaccard Index, number of Restaurants in common (Intersection), number of Restaurants in total (Union)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "        // get target user and their neighbors pairs and count \n",
    "        // of distinct restaurant that they have reviewed in common\n",
    "        MATCH (p1:Reviewer)-[:Wrote]->(r1:Review)-[:About]->(re:Restaurant)<-[:About]-(r2:Review)<-[:Wrote]-(p2:Reviewer)\n",
    "        WHERE p1 <> p2 AND p1.name = {p_name}\n",
    "        WITH p1, p2, COUNT(DISTINCT re) as intersection\n",
    "        \n",
    "        // get count of all the distinct restaurants that they have reviewed in total (Union)\n",
    "        MATCH (p:Reviewer)-[:Wrote]->(r:Review)-[:About]->(re:Restaurant)\n",
    "        WHERE p in [p1, p2]\n",
    "        WITH p1, p2, intersection, COUNT(DISTINCT re) as union\n",
    "        \n",
    "        // compute Jaccard index\n",
    "        WITH p1, p2, intersection, union, (intersection * 1.0 / union) as jaccard_index\n",
    "        \n",
    "        // get top k nearest neighbors based on Jaccard index\n",
    "        ORDER BY jaccard_index DESC, p2.name\n",
    "        WITH p1, COLLECT([p2.name, jaccard_index, intersection, union])[0..{k}] as neighbors\n",
    "        \n",
    "        WHERE SIZE(neighbors) = {k}   // return users with enough neighbors\n",
    "        RETURN p1.name as reviewer, neighbors\n",
    "\n",
    "        \"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Failed to write data to connection ('localhost', 7687) (Address(host='127.0.0.1', port=7687)); (\"10054; '远程主机强迫关闭了一个现有的连接。'; None; 10054; None\")\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "# User Justin Teo's 10 nearest neighbors: user_name, jaccard_index, intersection, union\n",
      "{'U0273': [['U0082', 0.23509933774834438, 71, 302],\n",
      "           ['U0492', 0.2, 57, 285],\n",
      "           ['U0241', 0.18345323741007194, 51, 278],\n",
      "           ['U0008', 0.17077464788732394, 97, 568],\n",
      "           ['U0012', 0.16906474820143885, 47, 278],\n",
      "           ['U0088', 0.16412213740458015, 43, 262],\n",
      "           ['U0057', 0.16333333333333333, 49, 300],\n",
      "           ['U0003', 0.16304347826086957, 45, 276],\n",
      "           ['U0028', 0.15827338129496402, 44, 278],\n",
      "           ['U0034', 0.1554054054054054, 46, 296]]}\n"
     ]
    }
   ],
   "source": [
    "neighbors = {}\n",
    "for i in graph.run(query, p_name = \"U0273\", k = 10):\n",
    "    neighbors[i[0]] = i[1]\n",
    "\n",
    "print(\"# User Justin Teo's 10 nearest neighbors: user_name, jaccard_index, intersection, union\")\n",
    "pprint(neighbors)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Find out the top 5 restaurants ranked by number of reviewed times from the nearest neighbors's reviewed restaurants "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "User U0273's recommendations: Restaurant, number of reviewed by neighbors\n",
      "{'U0273': [['Birds of a Feather', 10],\n",
      "           ['Alter Ego', 9],\n",
      "           ['The Coconut Club', 9],\n",
      "           ['Sunday Folks', 9],\n",
      "           ['Park Bench Deli', 9]]}\n"
     ]
    }
   ],
   "source": [
    "# get the list of the nearest neighbors names\n",
    "nearest_neighbors = [neighbors[\"U0273\"][i][0] for i in range(len(neighbors[\"U0273\"]))]\n",
    "\n",
    "query = \"\"\"\n",
    "        // get top n recommendations for user 'Justin Teo' from his nearest neighbors\n",
    "        MATCH (p1:Reviewer),\n",
    "              (neighbor:Reviewer)-[:Wrote]->(r:Review)-[:About]->(re:Restaurant)    \n",
    "        WHERE p1.name = {p_name}\n",
    "          AND neighbor.name in {nearest_neighbors}\n",
    "          AND not (p1)-[:Wrote]->(r:Review)-[:About]->(re:Restaurant)         // filter for movies that our user hasn't reviewed\n",
    "        \n",
    "        WITH p1, re, COUNT(DISTINCT neighbor) as countnns // times reviewed by nearest neighbors\n",
    "        ORDER BY p1.name, countnns DESC               \n",
    "        RETURN p1.name as user, COLLECT([re.name, countnns])[0..{n}] as recommendations  \n",
    "        \"\"\"\n",
    "\n",
    "recommendations = {}\n",
    "for i in graph.run(query, p_name = \"U0273\", nearest_neighbors = nearest_neighbors, n = 5):\n",
    "    recommendations[i[0]] = i[1]\n",
    "    \n",
    "print(\"User U0273's recommendations: Restaurant, number of reviewed by neighbors\")\n",
    "pprint(recommendations)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Unify the two parts above as a whole function. And using before_2019 graph to prepare for validation list"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'U0008': ['Park Bench Deli',\n",
      "           'Birds of a Feather',\n",
      "           'Wildseed (The Summerhouse)',\n",
      "           'Clinton St. Baking Co. & Restaurant Singapore',\n",
      "           'KEK Keng Eng Kee Seafood (Alexandra)'],\n",
      " 'U0014': ['The Coconut Club',\n",
      "           'Clinton St. Baking Co. & Restaurant Singapore',\n",
      "           'Birds of a Feather',\n",
      "           'The Masses',\n",
      "           'Sarnies (Telok Ayer)'],\n",
      " 'U0028': ['Hvala ',\n",
      "           'Matchaya (The Cathay)',\n",
      "           'Burnt Ends',\n",
      "           'Sunday Folks',\n",
      "           'RONIN'],\n",
      " 'U0034': ['Sunday Folks',\n",
      "           'Park Bench Deli',\n",
      "           'Wildseed (The Summerhouse)',\n",
      "           'Clinton St. Baking Co. & Restaurant Singapore',\n",
      "           'Alter Ego'],\n",
      " 'U0044': ['Clinton St. Baking Co. & Restaurant Singapore',\n",
      "           'KEK Keng Eng Kee Seafood (Alexandra)',\n",
      "           'Sunday Folks',\n",
      "           'Park Bench Deli',\n",
      "           'Nesuto'],\n",
      " 'U0057': ['Clinton St. Baking Co. & Restaurant Singapore',\n",
      "           'Sunday Folks',\n",
      "           'Park Bench Deli',\n",
      "           'RONIN',\n",
      "           'A Poke Theory (Telok Ayer)'],\n",
      " 'U0073': ['Clinton St. Baking Co. & Restaurant Singapore',\n",
      "           'Birds of a Feather',\n",
      "           'The Populus Coffee & Food Co.',\n",
      "           'Burnt Ends',\n",
      "           'Sunday Folks'],\n",
      " 'U0082': ['Creamier (Toa Payoh)',\n",
      "           'Sunday Folks',\n",
      "           'The Coffee Academics (Scotts Square)',\n",
      "           'Birds of a Feather',\n",
      "           'Clinton St. Baking Co. & Restaurant Singapore'],\n",
      " 'U0087': ['Clinton St. Baking Co. & Restaurant Singapore',\n",
      "           'Lunar Coffee Brewers',\n",
      "           'FATCAT Ice Cream Bar',\n",
      "           'Matchaya (The Cathay)',\n",
      "           'Brawn & Brains Coffee (Guillemard)'],\n",
      " 'U0088': ['Sunday Folks',\n",
      "           'Nesuto',\n",
      "           'Hvala ',\n",
      "           'KEK Keng Eng Kee Seafood (Alexandra)',\n",
      "           'Park Bench Deli'],\n",
      " 'U0143': ['Tarte by Cheryl Koh',\n",
      "           'The Populus Coffee & Food Co.',\n",
      "           'Sunday Folks',\n",
      "           'The Refinery',\n",
      "           'FATCAT Ice Cream Bar'],\n",
      " 'U0158': ['FATCAT Ice Cream Bar',\n",
      "           'Sunday Folks',\n",
      "           'The Populus Coffee & Food Co.',\n",
      "           'One Man Coffee (Upper Thomson)',\n",
      "           'Hvala '],\n",
      " 'U0241': ['Sunday Folks',\n",
      "           'Park Bench Deli',\n",
      "           'Clinton St. Baking Co. & Restaurant Singapore',\n",
      "           'Creamier (Toa Payoh)',\n",
      "           'RONIN'],\n",
      " 'U0255': ['Sunday Folks',\n",
      "           'Park Bench Deli',\n",
      "           'Clinton St. Baking Co. & Restaurant Singapore',\n",
      "           'The Populus Coffee & Food Co.',\n",
      "           \"L'éclair Pâtisserie (Dhoby Ghaut)\"],\n",
      " 'U0257': ['Sunday Folks',\n",
      "           'Wildseed (The Summerhouse)',\n",
      "           'Clinton St. Baking Co. & Restaurant Singapore',\n",
      "           'Tarte by Cheryl Koh',\n",
      "           'The Populus Coffee & Food Co.'],\n",
      " 'U0273': ['Clinton St. Baking Co. & Restaurant Singapore',\n",
      "           'Sunday Folks',\n",
      "           'The Populus Coffee & Food Co.',\n",
      "           'Grain Traders (Telok Ayer)',\n",
      "           'Koh Grill & Sushi Bar'],\n",
      " 'U0353': ['RONIN',\n",
      "           'Park Bench Deli',\n",
      "           'One Man Coffee (Upper Thomson)',\n",
      "           'Sunday Folks',\n",
      "           'Brawn & Brains Coffee (Guillemard)'],\n",
      " 'U0492': ['Birds of a Feather',\n",
      "           'Tarte by Cheryl Koh',\n",
      "           'The Populus Coffee & Food Co.',\n",
      "           'Sunday Folks',\n",
      "           'Firebake - Woodfired Bakehouse & Restaurant'],\n",
      " 'U0686': ['Birds of a Feather',\n",
      "           'FATCAT Ice Cream Bar',\n",
      "           'Matchaya (The Cathay)',\n",
      "           'Sunday Folks',\n",
      "           'The Masses'],\n",
      " 'U1418': ['Salted & Hung',\n",
      "           'Park Bench Deli',\n",
      "           'Artichoke',\n",
      "           'Birds of a Feather',\n",
      "           'Spago by Wolfgang Puck']}\n"
     ]
    }
   ],
   "source": [
    "import sys\n",
    "from pprint import pprint\n",
    "from py2neo import Graph\n",
    "\n",
    "# p_name = sys.argv[1:]\n",
    "p_name = reviewer\n",
    "\n",
    "graph = Graph(host=\"localhost://7474\", auth=(\"neo4j\", \"123456\"))\n",
    "\n",
    "def r_recommender(graph, cid, num_nearest_neighbors, num_recommendations):\n",
    "\n",
    "    query = \"\"\"\n",
    "           MATCH (p1:Reviewer)-[:Wrote]->(r1:Review)-[:About]->(re:Restaurant)<-[:About]-(r2:Review)<-[:Wrote]-(p2:Reviewer)\n",
    "           WHERE p1 <> p2 AND p1.name = {p_name}\n",
    "           WITH p1, p2, COUNT(DISTINCT re) as intersection\n",
    "           \n",
    "           MATCH (p:Reviewer)-[:Wrote]->(r:Review)-[:About]->(re:Restaurant)\n",
    "           WHERE p in [p1, p2]\n",
    "           WITH p1, p2, intersection, COUNT(DISTINCT re) as union\n",
    "\n",
    "           WITH p1, p2, intersection, union, \n",
    "              (intersection * 1.0 / union) as jaccard_index\n",
    "\n",
    "           ORDER BY jaccard_index DESC, p2.name\n",
    "           WITH p1, COLLECT(p2)[0..{k}] as neighbors\n",
    "           WHERE SIZE(neighbors) = {k}                                              \n",
    "           UNWIND neighbors as neighbor\n",
    "           WITH p1, neighbor\n",
    "\n",
    "           MATCH (neighbor)-[:Wrote]->(r:Review)-[:About]->(re:Restaurant)         \n",
    "           WHERE not (p1)-[:Wrote]->(r:Review)-[:About]->(re:Restaurant)                        \n",
    "           WITH p1, re, COUNT(DISTINCT neighbor) as countnns\n",
    "           ORDER BY p1.name, countnns DESC                            \n",
    "           RETURN p1.name as user, \n",
    "              COLLECT(re.name)[0..{n}] as recommendations  \n",
    "           \"\"\"\n",
    "\n",
    "    recommendations = {}\n",
    "    for p in p_name:\n",
    "        for i in graph.run(query, p_name = p, k = num_nearest_neighbors, n = num_recommendations):\n",
    "            recommendations[i[0]] = i[1]\n",
    "    return recommendations\n",
    "\n",
    "#query on burpple_before_2019\n",
    "recommendation = r_recommender(graph, p_name, 10, 5)\n",
    "pprint(recommendation)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Use all data graph to check if the user actually go to the recommended restaurant at 2019"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph2 = Graph(host=\"localhost://7474\", auth=(\"neo4j\", \"123456\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [],
   "source": [
    "def validation(graph, dic):\n",
    "    query = \"\"\"\n",
    "            MATCH (p:Reviewer)-[:Wrote]->(r:Review)-[:About]->(re:Restaurant)\n",
    "            WHERE p.name = {p_name} AND re.name IN {re_name}\n",
    "            RETURN p.name, re.name\n",
    "    \n",
    "            \"\"\"\n",
    "    result = []\n",
    "    for item in dic:\n",
    "        p = item\n",
    "        temp = []\n",
    "        temp.append(p)\n",
    "        ans = graph.run(query, p_name=p, re_name=dic[item]).data()\n",
    "        for val in ans:\n",
    "            if val['re.name'] not in temp:\n",
    "                temp.append(val['re.name'])          \n",
    "        if len(temp) > 1:\n",
    "            result.append(temp)\n",
    "\n",
    "    \n",
    "    return result\n",
    "\n",
    "#validation on all burpple\n",
    "result = validation(graph2, recommendation)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'U0008': ['Birds of a Feather',\n",
      "           'Wildseed (The Summerhouse)',\n",
      "           'Clinton St. Baking Co. & Restaurant Singapore',\n",
      "           'KEK Keng Eng Kee Seafood (Alexandra)',\n",
      "           'Park Bench Deli'],\n",
      " 'U0014': ['Birds of a Feather',\n",
      "           'Clinton St. Baking Co. & Restaurant Singapore',\n",
      "           'Sarnies (Telok Ayer)',\n",
      "           'The Masses'],\n",
      " 'U0028': ['Hvala ', 'Matchaya (The Cathay)', 'Sunday Folks'],\n",
      " 'U0034': ['Wildseed (The Summerhouse)',\n",
      "           'Clinton St. Baking Co. & Restaurant Singapore',\n",
      "           'Alter Ego',\n",
      "           'Sunday Folks',\n",
      "           'Park Bench Deli'],\n",
      " 'U0044': ['Clinton St. Baking Co. & Restaurant Singapore',\n",
      "           'KEK Keng Eng Kee Seafood (Alexandra)',\n",
      "           'Sunday Folks',\n",
      "           'Park Bench Deli',\n",
      "           'Nesuto'],\n",
      " 'U0057': ['Clinton St. Baking Co. & Restaurant Singapore',\n",
      "           'Sunday Folks',\n",
      "           'Park Bench Deli',\n",
      "           'RONIN'],\n",
      " 'U0073': ['Birds of a Feather',\n",
      "           'Clinton St. Baking Co. & Restaurant Singapore',\n",
      "           'The Populus Coffee & Food Co.',\n",
      "           'Burnt Ends'],\n",
      " 'U0082': ['Birds of a Feather',\n",
      "           'Clinton St. Baking Co. & Restaurant Singapore',\n",
      "           'Creamier (Toa Payoh)',\n",
      "           'Sunday Folks',\n",
      "           'The Coffee Academics (Scotts Square)'],\n",
      " 'U0087': ['Clinton St. Baking Co. & Restaurant Singapore',\n",
      "           'FATCAT Ice Cream Bar',\n",
      "           'Brawn & Brains Coffee (Guillemard)'],\n",
      " 'U0088': ['Hvala ', 'KEK Keng Eng Kee Seafood (Alexandra)', 'Park Bench Deli'],\n",
      " 'U0143': ['Tarte by Cheryl Koh',\n",
      "           'The Populus Coffee & Food Co.',\n",
      "           'Sunday Folks',\n",
      "           'The Refinery'],\n",
      " 'U0158': ['Hvala ',\n",
      "           'FATCAT Ice Cream Bar',\n",
      "           'Sunday Folks',\n",
      "           'One Man Coffee (Upper Thomson)'],\n",
      " 'U0241': ['Clinton St. Baking Co. & Restaurant Singapore',\n",
      "           'Creamier (Toa Payoh)',\n",
      "           'Sunday Folks',\n",
      "           'Park Bench Deli',\n",
      "           'RONIN'],\n",
      " 'U0255': ['Clinton St. Baking Co. & Restaurant Singapore',\n",
      "           'The Populus Coffee & Food Co.',\n",
      "           \"L'éclair Pâtisserie (Dhoby Ghaut)\",\n",
      "           'Sunday Folks',\n",
      "           'Park Bench Deli'],\n",
      " 'U0257': ['Wildseed (The Summerhouse)',\n",
      "           'Clinton St. Baking Co. & Restaurant Singapore',\n",
      "           'Tarte by Cheryl Koh',\n",
      "           'The Populus Coffee & Food Co.',\n",
      "           'Sunday Folks'],\n",
      " 'U0273': ['The Populus Coffee & Food Co.',\n",
      "           'Grain Traders (Telok Ayer)',\n",
      "           'Sunday Folks'],\n",
      " 'U0353': ['Brawn & Brains Coffee (Guillemard)',\n",
      "           'Sunday Folks',\n",
      "           'Park Bench Deli'],\n",
      " 'U0492': ['Birds of a Feather',\n",
      "           'Tarte by Cheryl Koh',\n",
      "           'The Populus Coffee & Food Co.',\n",
      "           'Sunday Folks',\n",
      "           'Firebake - Woodfired Bakehouse & Restaurant'],\n",
      " 'U0686': ['Birds of a Feather',\n",
      "           'FATCAT Ice Cream Bar',\n",
      "           'Sunday Folks',\n",
      "           'The Masses'],\n",
      " 'U1418': ['Birds of a Feather',\n",
      "           'Salted & Hung',\n",
      "           'Spago by Wolfgang Puck',\n",
      "           'Park Bench Deli',\n",
      "           'Artichoke']}\n"
     ]
    }
   ],
   "source": [
    "#print out the matched list\n",
    "result_dic = {}\n",
    "for i in range(len(result)):\n",
    "    name = result[i][0]\n",
    "    result_dic[name] = result[i][1:]\n",
    "    \n",
    "pprint(result_dic)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Get accuracy for each user by comparing the length of matched in 2019 and the length of recommendation."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'U0044': 1.0, 'U0492': 1.0, 'U0008': 1.0, 'U1418': 1.0, 'U0088': 0.6, 'U0241': 1.0, 'U0255': 1.0, 'U0057': 0.8, 'U0158': 0.8, 'U0143': 0.8, 'U0028': 0.6, 'U0073': 0.8, 'U0082': 1.0, 'U0257': 1.0, 'U0014': 0.8, 'U0034': 1.0, 'U0686': 0.8, 'U0353': 0.6, 'U0273': 0.6, 'U0087': 0.6}\n"
     ]
    }
   ],
   "source": [
    "accuracy = {}\n",
    "for item in result_dic:\n",
    "\n",
    "    accuracy[item] = len(result_dic[item])/len(recommendation[item])\n",
    "    \n",
    "print(accuracy)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Generate graph to visualize results"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#Query to generate target user, neighbors and restaurant relation graph\n",
    "\"\"\"\n",
    "MATCH (p1:Reviewer)-[:VISITED]->(re:Restaurant)<-[:VISITED]-(p2:Reviewer)\n",
    "WHERE p1 <> p2 AND p1.name = \"U0273\"\n",
    "WITH p1, p2, COUNT(DISTINCT re) as intersection\n",
    "\n",
    "MATCH (p:Reviewer)-[:VISITED]->(re:Restaurant)\n",
    "WHERE p in [p1, p2]\n",
    "WITH p1, p2, intersection, COUNT(DISTINCT re) as union\n",
    "\n",
    "WITH p1, p2, intersection, union, (intersection * 1.0 / union) as jaccard_index\n",
    "\n",
    "ORDER BY jaccard_index DESC, p2.name\n",
    "WITH p1, COLLECT(p2)[0..5] as neighbors\n",
    "WHERE SIZE(neighbors) = 5\n",
    "UNWIND neighbors as neighbor\n",
    "WITH p1, neighbor\n",
    "\n",
    "MATCH (neighbor)-[:VISITED]->(re:Restaurant)<-[:VISITED]-(p1)\n",
    "RETURN neighbor, p1,re\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#Query to generate neighbors and restaurants target user hasn't been yet\n",
    "\"\"\"\n",
    "MATCH (p1:Reviewer)-[:VISITED]->(re:Restaurant)<-[:VISITED]-(p2:Reviewer)\n",
    "WHERE p1 <> p2 AND p1.name = \"U0273\"\n",
    "WITH p1, p2, COUNT(DISTINCT re) as intersection\n",
    "\n",
    "MATCH (p:Reviewer)-[:VISITED]->(re:Restaurant)\n",
    "WHERE p in [p1, p2]\n",
    "WITH p1, p2, intersection, COUNT(DISTINCT re) as union\n",
    "\n",
    "WITH p1, p2, intersection, union, (intersection * 1.0 / union) as jaccard_index\n",
    "\n",
    "ORDER BY jaccard_index DESC, p2.name\n",
    "WITH p1, COLLECT(p2)[0..5] as neighbors\n",
    "WHERE SIZE(neighbors) = 5\n",
    "UNWIND neighbors as neighbor\n",
    "WITH p1, neighbor\n",
    "\n",
    "MATCH (neighbor)-[:VISITED]->(re:Restaurant)\n",
    "WHERE not (p1)-[:VISITED]->(re:Restaurant)\n",
    "RETURN neighbor, re\n",
    "\"\"\"\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
