{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [],
   "source": [
    "from py2neo import Graph\n",
    "from pandas import DataFrame\n",
    "from pprint import pprint"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Test"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph = Graph(host=\"localhost://7474\", auth=(\"neo4j\", \"123456\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'re.name': '/scaled-by-ah-hua-kelong',\n",
       "  'average_senti': 0.9188084357738098,\n",
       "  'number': 84},\n",
       " {'re.name': '/azmi-chappati-thye-chong-restaurant',\n",
       "  'average_senti': 0.9025676618888888,\n",
       "  'number': 18},\n",
       " {'re.name': '/red-sparrow',\n",
       "  'average_senti': 0.8993222303888889,\n",
       "  'number': 36},\n",
       " {'re.name': '/chef-kang', 'average_senti': 0.8990597711666669, 'number': 54},\n",
       " {'re.name': '/2RflyYEv', 'average_senti': 0.8904110564999997, 'number': 24},\n",
       " {'re.name': '/enjoy-eating-house-and-bar',\n",
       "  'average_senti': 0.8875170693916665,\n",
       "  'number': 120},\n",
       " {'re.name': '/han-kee-fish-soup',\n",
       "  'average_senti': 0.885581858611111,\n",
       "  'number': 36},\n",
       " {'re.name': '/mings-prawn-noodle',\n",
       "  'average_senti': 0.885323691611111,\n",
       "  'number': 18},\n",
       " {'re.name': '/obba-jjajang',\n",
       "  'average_senti': 0.8815650229027774,\n",
       "  'number': 72},\n",
       " {'re.name': '/su-korean-cuisine',\n",
       "  'average_senti': 0.8783748867857144,\n",
       "  'number': 42},\n",
       " {'re.name': '/pig-organ-soup-jalan-besar',\n",
       "  'average_senti': 0.8779657240000003,\n",
       "  'number': 66},\n",
       " {'re.name': '/swee-guan-hokkein-mee-kwong-satay',\n",
       "  'average_senti': 0.8765684531388889,\n",
       "  'number': 36},\n",
       " {'re.name': '/hong-ji-claypot-bak-kut-teh',\n",
       "  'average_senti': 0.8729252380000001,\n",
       "  'number': 36},\n",
       " {'re.name': '/yalong-bay', 'average_senti': 0.8728331611666669, 'number': 36},\n",
       " {'re.name': '/the-glass-onion',\n",
       "  'average_senti': 0.8720182110000001,\n",
       "  'number': 18},\n",
       " {'re.name': '/seoul-yummy-2',\n",
       "  'average_senti': 0.8709471486666667,\n",
       "  'number': 27},\n",
       " {'re.name': '/nude-seafoodmbfc-tower-3',\n",
       "  'average_senti': 0.8700202100277781,\n",
       "  'number': 108},\n",
       " {'re.name': '/joo-seng-teochew-porridge',\n",
       "  'average_senti': 0.8685201282083336,\n",
       "  'number': 48},\n",
       " {'re.name': '/violet-oon-singapore-at-jewel-changi-airport',\n",
       "  'average_senti': 0.8680660440285715,\n",
       "  'number': 35},\n",
       " {'re.name': '/five-spice', 'average_senti': 0.8679667393055556, 'number': 36},\n",
       " {'re.name': '/tian-tian-lai-fried-hokkien-mee',\n",
       "  'average_senti': 0.8677388823333333,\n",
       "  'number': 36},\n",
       " {'re.name': '/pepper-bowl',\n",
       "  'average_senti': 0.8666201608333334,\n",
       "  'number': 24},\n",
       " {'re.name': '/pho-street-bedok-mall',\n",
       "  'average_senti': 0.8661069010277778,\n",
       "  'number': 36},\n",
       " {'re.name': '/old-school-delights-esplanade-mall',\n",
       "  'average_senti': 0.8660065418333335,\n",
       "  'number': 42},\n",
       " {'re.name': '/isteamboat', 'average_senti': 0.8652766676000001, 'number': 30},\n",
       " {'re.name': '/8-korean-bbq-shaw-centre',\n",
       "  'average_senti': 0.8623886019375,\n",
       "  'number': 48},\n",
       " {'re.name': '/bismillah-biryani',\n",
       "  'average_senti': 0.8604791409999999,\n",
       "  'number': 24},\n",
       " {'re.name': '/famous-treasure',\n",
       "  'average_senti': 0.8601616237499999,\n",
       "  'number': 24},\n",
       " {'re.name': '/wok-master', 'average_senti': 0.8592937974722223, 'number': 36},\n",
       " {'re.name': '/foodcourt-great-world-city',\n",
       "  'average_senti': 0.8590540854666667,\n",
       "  'number': 30},\n",
       " {'re.name': '/zai-shun-curry-fish-head-seafood',\n",
       "  'average_senti': 0.8590390419999997,\n",
       "  'number': 89},\n",
       " {'re.name': '/city-hot-pot-at-one-raffles-place',\n",
       "  'average_senti': 0.8585891869166669,\n",
       "  'number': 36},\n",
       " {'re.name': '/leng-kee-fish-soup',\n",
       "  'average_senti': 0.8585885987499999,\n",
       "  'number': 16},\n",
       " {'re.name': '/chin-lee-restaurant',\n",
       "  'average_senti': 0.8559555010204081,\n",
       "  'number': 49},\n",
       " {'re.name': '/souperstar-century-square',\n",
       "  'average_senti': 0.8557378068333333,\n",
       "  'number': 24},\n",
       " {'re.name': '/chong-qing-grilled-fish-serangoon',\n",
       "  'average_senti': 0.8556866607368421,\n",
       "  'number': 19},\n",
       " {'re.name': '/moc-quan', 'average_senti': 0.8554060600740739, 'number': 54},\n",
       " {'re.name': '/holycrab', 'average_senti': 0.8544363686333334, 'number': 30},\n",
       " {'re.name': '/sungei-road-laksa',\n",
       "  'average_senti': 0.8537316496025642,\n",
       "  'number': 78},\n",
       " {'re.name': '/eat-3-bowls',\n",
       "  'average_senti': 0.8523857312291665,\n",
       "  'number': 96},\n",
       " {'re.name': '/sum-yi-tai', 'average_senti': 0.8517937543809524, 'number': 84},\n",
       " {'re.name': '/the-screening-room',\n",
       "  'average_senti': 0.8508857950416667,\n",
       "  'number': 24},\n",
       " {'re.name': '/meatsmith-little-india',\n",
       "  'average_senti': 0.8508413731372548,\n",
       "  'number': 102},\n",
       " {'re.name': '/menyakokorosg',\n",
       "  'average_senti': 0.8507363612976193,\n",
       "  'number': 84},\n",
       " {'re.name': '/house-of-happiness',\n",
       "  'average_senti': 0.8494630391875,\n",
       "  'number': 48},\n",
       " {'re.name': '/baan-ying', 'average_senti': 0.8494347987435896, 'number': 78},\n",
       " {'re.name': '/ang-mo-kio-central-market-hawker-centre',\n",
       "  'average_senti': 0.8490177871818184,\n",
       "  'number': 66},\n",
       " {'re.name': '/chomp-chomp-food-centre',\n",
       "  'average_senti': 0.8482851139014778,\n",
       "  'number': 203},\n",
       " {'re.name': '/thesaltedplumsg',\n",
       "  'average_senti': 0.8460550187323235,\n",
       "  'number': 198},\n",
       " {'re.name': '/gorogoro-steamboat-korean-buffet',\n",
       "  'average_senti': 0.845712626,\n",
       "  'number': 36},\n",
       " {'re.name': '/hyang-yeon', 'average_senti': 0.8455953083750001, 'number': 48},\n",
       " {'re.name': '/mei-yuen-restaurant',\n",
       "  'average_senti': 0.8453057226428572,\n",
       "  'number': 28},\n",
       " {'re.name': '/delicious-boneless-chicken-rice',\n",
       "  'average_senti': 0.8449375374848485,\n",
       "  'number': 66},\n",
       " {'re.name': '/the-coconut-club',\n",
       "  'average_senti': 0.8445144120416664,\n",
       "  'number': 144},\n",
       " {'re.name': '/emerald-hill-no',\n",
       "  'average_senti': 0.8444917558888887,\n",
       "  'number': 36},\n",
       " {'re.name': '/fook-kin', 'average_senti': 0.8443987322857142, 'number': 84},\n",
       " {'re.name': '/sama-curry-cafe-sg',\n",
       "  'average_senti': 0.8443603689444444,\n",
       "  'number': 36},\n",
       " {'re.name': '/tonkin-vietnamese-noodle-coffee',\n",
       "  'average_senti': 0.8442398094999999,\n",
       "  'number': 18},\n",
       " {'re.name': '/green-on-earth',\n",
       "  'average_senti': 0.8442360235000002,\n",
       "  'number': 18},\n",
       " {'re.name': '/wee-nam-kee-hainanese-chicken-rice-restaurant',\n",
       "  'average_senti': 0.8440577779696969,\n",
       "  'number': 66},\n",
       " {'re.name': '/geylang-claypot-rice',\n",
       "  'average_senti': 0.8438704820185184,\n",
       "  'number': 54},\n",
       " {'re.name': '/xiang-dessert-food',\n",
       "  'average_senti': 0.8430938742000003,\n",
       "  'number': 30},\n",
       " {'re.name': '/dumpling-darlings',\n",
       "  'average_senti': 0.8430107126829265,\n",
       "  'number': 246},\n",
       " {'re.name': '/jia-bin-klang-bak-kut-teh',\n",
       "  'average_senti': 0.8425197497708333,\n",
       "  'number': 48},\n",
       " {'re.name': '/brown-sugar',\n",
       "  'average_senti': 0.8420171639444444,\n",
       "  'number': 18},\n",
       " {'re.name': '/lims-fried-oyster',\n",
       "  'average_senti': 0.8416507886944443,\n",
       "  'number': 36},\n",
       " {'re.name': '/long-phung-vietnamese-restaurant',\n",
       "  'average_senti': 0.8412447078039218,\n",
       "  'number': 102},\n",
       " {'re.name': '/basil-thai-kitchen-1',\n",
       "  'average_senti': 0.8397589180666668,\n",
       "  'number': 60},\n",
       " {'re.name': '/mrs-pho-1', 'average_senti': 0.8390540282777776, 'number': 18},\n",
       " {'re.name': '/dancing-crab-vivo-city',\n",
       "  'average_senti': 0.8386711798541668,\n",
       "  'number': 48},\n",
       " {'re.name': '/som-tam', 'average_senti': 0.8381175415681819, 'number': 132},\n",
       " {'re.name': '/yun-nans', 'average_senti': 0.8378790035166668, 'number': 60},\n",
       " {'re.name': '/pho-99-vietnamese-delight-telok-ayer-street',\n",
       "  'average_senti': 0.8362427068333333,\n",
       "  'number': 36},\n",
       " {'re.name': '/randy-indulgence',\n",
       "  'average_senti': 0.8355907596388888,\n",
       "  'number': 36},\n",
       " {'re.name': '/aquamarine', 'average_senti': 0.8351732867333334, 'number': 90},\n",
       " {'re.name': '/penang-food-restaurant',\n",
       "  'average_senti': 0.834322556846154,\n",
       "  'number': 156},\n",
       " {'re.name': '/fei-fei-roastednoodle',\n",
       "  'average_senti': 0.83367317225,\n",
       "  'number': 24},\n",
       " {'re.name': '/no18-zion-road-fried-kway-teow',\n",
       "  'average_senti': 0.8332726227083334,\n",
       "  'number': 24},\n",
       " {'re.name': '/the-dragon-chamber',\n",
       "  'average_senti': 0.8331053298000002,\n",
       "  'number': 30},\n",
       " {'re.name': '/yy-kafei-dian',\n",
       "  'average_senti': 0.8328869854513274,\n",
       "  'number': 113},\n",
       " {'re.name': '/cherry-garden-mandarin-oriental',\n",
       "  'average_senti': 0.8326132030357143,\n",
       "  'number': 84},\n",
       " {'re.name': '/geylang-lorong-29-fried-hokkien-mee',\n",
       "  'average_senti': 0.8325862574406778,\n",
       "  'number': 59},\n",
       " {'re.name': '/ahhuaeatinghouse',\n",
       "  'average_senti': 0.8325476925833333,\n",
       "  'number': 24},\n",
       " {'re.name': '/south-buona-vista-road-famous-teochew-boneless-duck',\n",
       "  'average_senti': 0.8322549541250001,\n",
       "  'number': 24},\n",
       " {'re.name': '/kopitiam-12',\n",
       "  'average_senti': 0.8312363484042553,\n",
       "  'number': 47},\n",
       " {'re.name': '/kok-sen-restaurant',\n",
       "  'average_senti': 0.8309518753988441,\n",
       "  'number': 173},\n",
       " {'re.name': '/hyanggogol-korean-restuarant',\n",
       "  'average_senti': 0.8304705541428568,\n",
       "  'number': 42},\n",
       " {'re.name': '/just-dough', 'average_senti': 0.8301407736145833, 'number': 96},\n",
       " {'re.name': '/koungs-wan-tan-mee',\n",
       "  'average_senti': 0.8301350004523808,\n",
       "  'number': 42},\n",
       " {'re.name': '/sawadee-thai-cuisine',\n",
       "  'average_senti': 0.8297570119444446,\n",
       "  'number': 54},\n",
       " {'re.name': '/nanjing-impressions-plaza-singapura',\n",
       "  'average_senti': 0.8295715918072295,\n",
       "  'number': 83},\n",
       " {'re.name': '/chong-pang-market-food-centre',\n",
       "  'average_senti': 0.8290533640462963,\n",
       "  'number': 108},\n",
       " {'re.name': '/hyangtogol', 'average_senti': 0.8283791407333332, 'number': 30},\n",
       " {'re.name': '/tong-ah-eating-house',\n",
       "  'average_senti': 0.8283258822716048,\n",
       "  'number': 162},\n",
       " {'re.name': '/zion-riverside-food-centre',\n",
       "  'average_senti': 0.8279992262352942,\n",
       "  'number': 102},\n",
       " {'re.name': '/mister-wu', 'average_senti': 0.8279519095, 'number': 24},\n",
       " {'re.name': '/928-yishun-laksa',\n",
       "  'average_senti': 0.8279052387380955,\n",
       "  'number': 42},\n",
       " {'re.name': '/swee-choon-dim-sum',\n",
       "  'average_senti': 0.8266538104044113,\n",
       "  'number': 408},\n",
       " {'re.name': '/chong-qing-grilled-fish-1',\n",
       "  'average_senti': 0.8256727707419355,\n",
       "  'number': 31},\n",
       " {'re.name': '/chong-pang-nasi-lemak',\n",
       "  'average_senti': 0.8254723760555556,\n",
       "  'number': 36},\n",
       " {'re.name': '/singapore-fried-hokkien-mee',\n",
       "  'average_senti': 0.8251486059375002,\n",
       "  'number': 96},\n",
       " {'re.name': '/gallery-co', 'average_senti': 0.8247215768333335, 'number': 54},\n",
       " {'re.name': '/heap-seng-leong-coffeeshop',\n",
       "  'average_senti': 0.8245715698431374,\n",
       "  'number': 102},\n",
       " {'re.name': '/hill-street-tai-hwa-pork-noodle',\n",
       "  'average_senti': 0.8235329587126434,\n",
       "  'number': 174},\n",
       " {'re.name': '/albert-centre-market-food-centre-queen-street-market',\n",
       "  'average_senti': 0.8231783236319443,\n",
       "  'number': 144},\n",
       " {'re.name': '/crystal-jade-palace-restaurant',\n",
       "  'average_senti': 0.8231608436410258,\n",
       "  'number': 78},\n",
       " {'re.name': '/bedok-85-market',\n",
       "  'average_senti': 0.8227704443016759,\n",
       "  'number': 358},\n",
       " {'re.name': '/shunfu-mart', 'average_senti': 0.822681234952381, 'number': 42},\n",
       " {'re.name': '/relish-frasers',\n",
       "  'average_senti': 0.8226477781111112,\n",
       "  'number': 54},\n",
       " {'re.name': '/ah-loy-thai',\n",
       "  'average_senti': 0.8216176751018517,\n",
       "  'number': 108},\n",
       " {'re.name': '/canton-paradise-marina-bay-sands',\n",
       "  'average_senti': 0.8216098891666667,\n",
       "  'number': 60},\n",
       " {'re.name': '/korat-thai-cafe-orchard-tower',\n",
       "  'average_senti': 0.8213044687575758,\n",
       "  'number': 33},\n",
       " {'re.name': '/brotherbird-milk-croissants',\n",
       "  'average_senti': 0.8206090558333335,\n",
       "  'number': 54},\n",
       " {'re.name': '/greendot', 'average_senti': 0.8205604283333334, 'number': 36},\n",
       " {'re.name': '/dim-sum-haus-at-57-jln-besar',\n",
       "  'average_senti': 0.8205169875227274,\n",
       "  'number': 132},\n",
       " {'re.name': '/fZw8TQW3', 'average_senti': 0.8203076216000003, 'number': 60},\n",
       " {'re.name': '/legendary-hong-kong',\n",
       "  'average_senti': 0.8201055914583333,\n",
       "  'number': 144},\n",
       " {'re.name': '/keng-eng-kee-seafood',\n",
       "  'average_senti': 0.8201040963947371,\n",
       "  'number': 228},\n",
       " {'re.name': '/tiong-bahru-market-food-centre',\n",
       "  'average_senti': 0.8199798618301375,\n",
       "  'number': 365},\n",
       " {'re.name': '/l32', 'average_senti': 0.8198743800757576, 'number': 66},\n",
       " {'re.name': '/mui-kee-singapore',\n",
       "  'average_senti': 0.8197221745526316,\n",
       "  'number': 114},\n",
       " {'re.name': '/beach-road-scissor-cut-curry-rice',\n",
       "  'average_senti': 0.819333690755245,\n",
       "  'number': 143},\n",
       " {'re.name': '/malaysia-boleh',\n",
       "  'average_senti': 0.8189122319226189,\n",
       "  'number': 168},\n",
       " {'re.name': '/ponggol-nasi-lemak-centre',\n",
       "  'average_senti': 0.8182327081500002,\n",
       "  'number': 60},\n",
       " {'re.name': '/ghim-moh-market-food-centre',\n",
       "  'average_senti': 0.8180131343631286,\n",
       "  'number': 179},\n",
       " {'re.name': '/fongshenghaosg',\n",
       "  'average_senti': 0.8167657341935484,\n",
       "  'number': 31},\n",
       " {'re.name': '/kim-keat-hokkien-mee',\n",
       "  'average_senti': 0.8165366215714285,\n",
       "  'number': 119},\n",
       " {'re.name': '/enaq-restaurant',\n",
       "  'average_senti': 0.8164790118030304,\n",
       "  'number': 66},\n",
       " {'re.name': '/putien-ion-orchard',\n",
       "  'average_senti': 0.8162953473166665,\n",
       "  'number': 60},\n",
       " {'re.name': '/nam-sing-hokkien-fried-mee-hougang',\n",
       "  'average_senti': 0.8159353141333331,\n",
       "  'number': 30},\n",
       " {'re.name': '/boufe-income-raffles',\n",
       "  'average_senti': 0.8157277884814815,\n",
       "  'number': 27},\n",
       " {'re.name': '/mr-and-mrs-mohgans-super-crispy-roti-prata',\n",
       "  'average_senti': 0.815001320064935,\n",
       "  'number': 77},\n",
       " {'re.name': '/maxwell-food-centre',\n",
       "  'average_senti': 0.814208490380952,\n",
       "  'number': 336},\n",
       " {'re.name': '/kamsroast-jewel',\n",
       "  'average_senti': 0.814164655375,\n",
       "  'number': 24},\n",
       " {'re.name': '/kasoh-seafood-restaurant',\n",
       "  'average_senti': 0.8140605810166668,\n",
       "  'number': 60},\n",
       " {'re.name': '/uncle-leong-seafood-3',\n",
       "  'average_senti': 0.8139074821296295,\n",
       "  'number': 54},\n",
       " {'re.name': '/chinatown-complex-market-food-centre',\n",
       "  'average_senti': 0.8136030300235286,\n",
       "  'number': 425},\n",
       " {'re.name': '/bake-cheese-tart-singapore',\n",
       "  'average_senti': 0.8134727661041666,\n",
       "  'number': 96},\n",
       " {'re.name': '/tanglin-halt-commonwealth-drive-food-centre-2',\n",
       "  'average_senti': 0.8125705893333333,\n",
       "  'number': 42},\n",
       " {'re.name': '/21-seafood-kovan',\n",
       "  'average_senti': 0.8115389562916667,\n",
       "  'number': 24},\n",
       " {'re.name': '/beiing-yun-tuen-noodle',\n",
       "  'average_senti': 0.8110833810487806,\n",
       "  'number': 41},\n",
       " {'re.name': '/lau-pa-sat-festival-market',\n",
       "  'average_senti': 0.8093860090448715,\n",
       "  'number': 156},\n",
       " {'re.name': '/grub', 'average_senti': 0.8092247487318615, 'number': 317},\n",
       " {'re.name': '/hawker-chan',\n",
       "  'average_senti': 0.8089312160555555,\n",
       "  'number': 54},\n",
       " {'re.name': '/geylang-lorong-9-beef-kway-teow',\n",
       "  'average_senti': 0.8088712745555553,\n",
       "  'number': 36},\n",
       " {'re.name': '/haig-road-market-cooked-food-centre',\n",
       "  'average_senti': 0.8085205722261906,\n",
       "  'number': 84},\n",
       " {'re.name': '/ah-lock-co', 'average_senti': 0.8077450758611111, 'number': 36},\n",
       " {'re.name': '/the-original-katong-laksa',\n",
       "  'average_senti': 0.8073163441666666,\n",
       "  'number': 30},\n",
       " {'re.name': '/zhong-guo-la-mian-xiao-long-bao',\n",
       "  'average_senti': 0.8068555604358976,\n",
       "  'number': 78},\n",
       " {'re.name': '/thaipan-restaurant-mandarin-garden-condominium',\n",
       "  'average_senti': 0.8051212671111111,\n",
       "  'number': 18},\n",
       " {'re.name': '/roast-paradise',\n",
       "  'average_senti': 0.8045004049545456,\n",
       "  'number': 66},\n",
       " {'re.name': '/soi47', 'average_senti': 0.803783584888889, 'number': 36},\n",
       " {'re.name': '/alazhar-eating-restaurant',\n",
       "  'average_senti': 0.8037509943888891,\n",
       "  'number': 108},\n",
       " {'re.name': '/jiangnan-chun',\n",
       "  'average_senti': 0.8035793483194443,\n",
       "  'number': 72},\n",
       " {'re.name': '/nunsaram-korean-dessert-cafe',\n",
       "  'average_senti': 0.8021947858055555,\n",
       "  'number': 108},\n",
       " {'re.name': '/guo-fu-steamboat',\n",
       "  'average_senti': 0.8021268874166667,\n",
       "  'number': 36},\n",
       " {'re.name': '/redhill-market-food-centre',\n",
       "  'average_senti': 0.7999843150444439,\n",
       "  'number': 180},\n",
       " {'re.name': '/taan', 'average_senti': 0.7994143347857144, 'number': 42},\n",
       " {'re.name': '/s11-bishan', 'average_senti': 0.7993659729999999, 'number': 30},\n",
       " {'re.name': '/lokkee', 'average_senti': 0.7984552279166667, 'number': 96},\n",
       " {'re.name': '/white-restaurant-1',\n",
       "  'average_senti': 0.7981892548076923,\n",
       "  'number': 26},\n",
       " {'re.name': '/tiew-mai-thai-boat-noodles',\n",
       "  'average_senti': 0.797092735125,\n",
       "  'number': 24},\n",
       " {'re.name': '/the-roti-prata-house',\n",
       "  'average_senti': 0.7967315218842104,\n",
       "  'number': 95},\n",
       " {'re.name': '/tsui-wah-singapore',\n",
       "  'average_senti': 0.7961323064444445,\n",
       "  'number': 90},\n",
       " {'re.name': '/springleaf-prata-place-at-jalan-tua-kong',\n",
       "  'average_senti': 0.7957366283703707,\n",
       "  'number': 108},\n",
       " {'re.name': '/mouth-restaurant-maxwell',\n",
       "  'average_senti': 0.7954768498761061,\n",
       "  'number': 113},\n",
       " {'re.name': '/fei-fei-wanton-mee',\n",
       "  'average_senti': 0.7946159737083334,\n",
       "  'number': 48},\n",
       " {'re.name': '/kko-kko-nara-korean-fried-chicken',\n",
       "  'average_senti': 0.7944649326250003,\n",
       "  'number': 120},\n",
       " {'re.name': '/food-republic-19',\n",
       "  'average_senti': 0.794211515189394,\n",
       "  'number': 132},\n",
       " {'re.name': '/lams-abalone-noodles-lavender',\n",
       "  'average_senti': 0.7933267969305556,\n",
       "  'number': 72},\n",
       " {'re.name': '/founder-bak-kut-teh-north-bridge-road',\n",
       "  'average_senti': 0.793159576738095,\n",
       "  'number': 42},\n",
       " {'re.name': '/wan-he-lou', 'average_senti': 0.7929000268644071, 'number': 59},\n",
       " {'re.name': '/sumo-big-prawn',\n",
       "  'average_senti': 0.7917905278833335,\n",
       "  'number': 60},\n",
       " {'re.name': '/asian-market-cafe-fairmont-hotel',\n",
       "  'average_senti': 0.790974212726191,\n",
       "  'number': 84},\n",
       " {'re.name': '/chengs-at-27-yong-siak-st',\n",
       "  'average_senti': 0.7909273560833334,\n",
       "  'number': 24},\n",
       " {'re.name': '/baobao', 'average_senti': 0.7901931834333333, 'number': 30},\n",
       " {'re.name': '/two-chefs', 'average_senti': 0.7898995224861114, 'number': 72},\n",
       " {'re.name': '/imperial-treasure-fine-chinese-cuisine',\n",
       "  'average_senti': 0.7895362030606061,\n",
       "  'number': 66},\n",
       " {'re.name': '/edith-patisserie',\n",
       "  'average_senti': 0.7887842977027026,\n",
       "  'number': 37},\n",
       " {'re.name': '/victors-kitchen-sunshine-plaza',\n",
       "  'average_senti': 0.7881426296538461,\n",
       "  'number': 208},\n",
       " {'re.name': '/mcdonaldstm-tiong-bahru-plaza',\n",
       "  'average_senti': 0.7877863695666665,\n",
       "  'number': 30},\n",
       " {'re.name': '/ntuc-foodfare-amk-hub',\n",
       "  'average_senti': 0.7877090514883722,\n",
       "  'number': 43},\n",
       " {'re.name': '/chong-qing-grilled-fish',\n",
       "  'average_senti': 0.784869904361446,\n",
       "  'number': 83},\n",
       " {'re.name': '/ah-ter-fishball-noodle-bar',\n",
       "  'average_senti': 0.7848484692500001,\n",
       "  'number': 24},\n",
       " {'re.name': '/uncle-leong-seafood',\n",
       "  'average_senti': 0.7847002863333337,\n",
       "  'number': 54},\n",
       " {'re.name': '/kok-kee-wonton-noodle',\n",
       "  'average_senti': 0.7838621831515151,\n",
       "  'number': 66},\n",
       " {'re.name': '/victor-famous-fried-chicken-wing-rice-veerasamy-road',\n",
       "  'average_senti': 0.782722007111111,\n",
       "  'number': 18},\n",
       " {'re.name': '/empress', 'average_senti': 0.7795226830925929, 'number': 54},\n",
       " {'re.name': '/yinji-singapore',\n",
       "  'average_senti': 0.7761107899523809,\n",
       "  'number': 42},\n",
       " {'re.name': '/food-opera-ion-orchard',\n",
       "  'average_senti': 0.7733505082685187,\n",
       "  'number': 108},\n",
       " {'re.name': '/add-the-original-boat-noodle',\n",
       "  'average_senti': 0.77259423948,\n",
       "  'number': 25},\n",
       " {'re.name': '/dynasty-ipoh-seafood',\n",
       "  'average_senti': 0.7719489356521738,\n",
       "  'number': 23},\n",
       " {'re.name': '/white-restaurant-sun-plaza',\n",
       "  'average_senti': 0.7718100718833338,\n",
       "  'number': 60},\n",
       " {'re.name': '/wanton-sengs-noodle-bar',\n",
       "  'average_senti': 0.7694471695438597,\n",
       "  'number': 114},\n",
       " {'re.name': '/engs-char-siew-wantan-mee',\n",
       "  'average_senti': 0.7673303780416667,\n",
       "  'number': 24},\n",
       " {'re.name': '/don-signature-crab',\n",
       "  'average_senti': 0.7663117095333333,\n",
       "  'number': 30},\n",
       " {'re.name': '/hollin-singapore',\n",
       "  'average_senti': 0.7654743843809526,\n",
       "  'number': 84},\n",
       " {'re.name': '/15-stamford',\n",
       "  'average_senti': 0.7644657122333335,\n",
       "  'number': 30},\n",
       " {'re.name': '/jiugongge', 'average_senti': 0.756491709, 'number': 26},\n",
       " {'re.name': '/parklane-zha-yun-tun-mee-house',\n",
       "  'average_senti': 0.7409003298541669,\n",
       "  'number': 48},\n",
       " {'re.name': '/good-year-local-hainanese-chicken-rice-ball-toa-payoh',\n",
       "  'average_senti': 0.7395832718333337,\n",
       "  'number': 42},\n",
       " {'re.name': '/chef-kangs-noodle-house',\n",
       "  'average_senti': 0.735942019375,\n",
       "  'number': 24},\n",
       " {'re.name': '/nyonya-chendol',\n",
       "  'average_senti': 0.7186578986956521,\n",
       "  'number': 23},\n",
       " {'re.name': '/prawnaholic-sg',\n",
       "  'average_senti': 0.7039056394583335,\n",
       "  'number': 24},\n",
       " {'re.name': '/saap-saap-thai-at-tampines-hub',\n",
       "  'average_senti': 0.7014596890000001,\n",
       "  'number': 18},\n",
       " {'re.name': '/waterway-point',\n",
       "  'average_senti': 0.6795492869750002,\n",
       "  'number': 40},\n",
       " {'re.name': '/guans-mee-pok', 'average_senti': 0.6461016575, 'number': 24}]"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "        MATCH (r:Review)-[a:About]->(re:Restaurant)\n",
    "        WHERE re.cuisine = 'local'\n",
    "        WITH re,COUNT(r) AS number,SUM(a.restaurant_sentiment) AS senti      \n",
    "        \n",
    "        RETURN re.name, senti/number AS average_senti, number\n",
    "        ORDER BY average_senti DESC\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "a=graph.run(query).data()\n",
    "a"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 72,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'re.name': '/power-coffeehouse', 'average_senti': 0.980081348, 'number': 1},\n",
       " {'re.name': '/bedok-85-market',\n",
       "  'average_senti': 0.9783189109999999,\n",
       "  'number': 1},\n",
       " {'re.name': '/tanglin-halt-commonwealth-drive-food-centre-2',\n",
       "  'average_senti': 0.9696601659999999,\n",
       "  'number': 1},\n",
       " {'re.name': '/ghim-moh-market-food-centre',\n",
       "  'average_senti': 0.959340527,\n",
       "  'number': 1},\n",
       " {'re.name': '/albert-centre-market-food-centre-queen-street-market',\n",
       "  'average_senti': 0.9526417290000001,\n",
       "  'number': 1},\n",
       " {'re.name': '/redhill-market-food-centre',\n",
       "  'average_senti': 0.943759565,\n",
       "  'number': 1},\n",
       " {'re.name': '/victor-famous-fried-chicken-wing-rice-veerasamy-road',\n",
       "  'average_senti': 0.9385110145,\n",
       "  'number': 2},\n",
       " {'re.name': '/hambaobao', 'average_senti': 0.926456893, 'number': 1},\n",
       " {'re.name': '/roast-paradise', 'average_senti': 0.920202953, 'number': 1},\n",
       " {'re.name': '/geylang-claypot-rice',\n",
       "  'average_senti': 0.916828027,\n",
       "  'number': 1},\n",
       " {'re.name': '/malaysia-boleh', 'average_senti': 0.909544873, 'number': 1},\n",
       " {'re.name': '/tamashii-robataya', 'average_senti': 0.899716324, 'number': 1},\n",
       " {'re.name': '/lantern-the-fullerton-bay-hotel-singapore',\n",
       "  'average_senti': 0.8947130809999999,\n",
       "  'number': 1},\n",
       " {'re.name': '/delicious-boneless-chicken-rice',\n",
       "  'average_senti': 0.886709994111111,\n",
       "  'number': 9},\n",
       " {'re.name': '/food-opera-ion-orchard',\n",
       "  'average_senti': 0.8653334615,\n",
       "  'number': 2},\n",
       " {'re.name': '/s11-bishan', 'average_senti': 0.85354556275, 'number': 4},\n",
       " {'re.name': '/waterway-point', 'average_senti': 0.846222438, 'number': 1},\n",
       " {'re.name': '/creatures', 'average_senti': 0.845635204, 'number': 1},\n",
       " {'re.name': '/susan-chan-fod', 'average_senti': 0.834518195, 'number': 1},\n",
       " {'re.name': '/wee-nam-kee-hainanese-chicken-rice-restaurant',\n",
       "  'average_senti': 0.83081079425,\n",
       "  'number': 12},\n",
       " {'re.name': '/food-republic-19', 'average_senti': 0.8253946255, 'number': 2},\n",
       " {'re.name': '/he-he-ju-kampong-chicken-rice',\n",
       "  'average_senti': 0.8243043926666668,\n",
       "  'number': 3},\n",
       " {'re.name': '/hawker-chan', 'average_senti': 0.812249608, 'number': 3},\n",
       " {'re.name': '/chinatown-complex-market-food-centre',\n",
       "  'average_senti': 0.8016605695,\n",
       "  'number': 4},\n",
       " {'re.name': '/maxwell-food-centre',\n",
       "  'average_senti': 0.8001564314999999,\n",
       "  'number': 6},\n",
       " {'re.name': '/good-year-local-hainanese-chicken-rice-ball-toa-payoh',\n",
       "  'average_senti': 0.7688851441923078,\n",
       "  'number': 26},\n",
       " {'re.name': '/tiong-bahru-market-food-centre',\n",
       "  'average_senti': 0.7688827870000001,\n",
       "  'number': 2},\n",
       " {'re.name': '/the-populus-coffee-food-co',\n",
       "  'average_senti': 0.7170735640000001,\n",
       "  'number': 1},\n",
       " {'re.name': '/singapore-fried-hokkien-mee',\n",
       "  'average_senti': 0.648464071,\n",
       "  'number': 1},\n",
       " {'re.name': '/ang-mo-kio-central-market-hawker-centre',\n",
       "  'average_senti': 0.627303802,\n",
       "  'number': 1}]"
      ]
     },
     "execution_count": 72,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query_b = \"\"\"\n",
    "        MATCH (r:Review)-[c:Contains]->(f:Food)\n",
    "        WHERE f.name = 'chickenrice'\n",
    "        WITH DISTINCT r, c\n",
    "        MATCH (r)-[a:About]->(re:Restaurant)\n",
    "        RETURN re.name, sum(c.food_sentiment)/count(r) AS average_senti, count(r) AS number\n",
    "        ORDER BY average_senti DESC\n",
    "        \"\"\"\n",
    "b=graph.run(query_b).data()\n",
    "b"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'/scaled-by-ah-hua-kelong'"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Search query functions"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 112,
   "metadata": {},
   "outputs": [],
   "source": [
    "def search_restaurant_by_food(graph,text,sort):\n",
    "    result=[]\n",
    "    key_words = text\n",
    "    \n",
    "    query_rating = \"\"\"\n",
    "        MATCH (r:Review)-[c:Contains]->(f:Food)\n",
    "        WHERE f.name = {term}\n",
    "        WITH DISTINCT r, c\n",
    "        MATCH (r)-[a:About]->(re:Restaurant)\n",
    "        RETURN re.name, sum(c.food_sentiment)/count(r) AS average_senti, count(r) AS number\n",
    "        ORDER BY average_senti DESC\n",
    "        \"\"\"\n",
    "    query_popularity = \"\"\"\n",
    "        MATCH (r:Review)-[c:Contains]->(f:Food)\n",
    "        WHERE f.name = {term}\n",
    "        WITH DISTINCT r, c\n",
    "        MATCH (r)-[a:About]->(re:Restaurant)\n",
    "        RETURN re.name, sum(c.food_sentiment)/count(r) AS average_senti, count(r) AS number\n",
    "        ORDER BY number DESC\n",
    "        \"\"\"\n",
    "    \n",
    "    if sort == 'number_of_reviews':\n",
    "        query = query_popularity\n",
    "\n",
    "    if sort == 'rating':\n",
    "        query = query_rating\n",
    "        \n",
    "    ans = graph.run(query,term=text).data()\n",
    "    \n",
    "    if ans:\n",
    "        for item in ans:\n",
    "            result.append(item[re.name])\n",
    "        return result\n",
    "    \n",
    "    if not ans:\n",
    "        key_words = key_words.split()\n",
    "        result={}\n",
    "        \n",
    "        for i in range(len(key_words)):\n",
    "            temp = graph.run(query, term=key_words[i]).data()\n",
    "            result[key_words[i]]=[]\n",
    "            for item in temp:\n",
    "                result[key_words[i]].append(item[re.name])\n",
    "                \n",
    "        if not result:\n",
    "            return ['No records found']\n",
    "        else:\n",
    "            return result\n",
    "        \n",
    "\n",
    "def search_restaurant_by_cusine(text,sort):\n",
    "    result=[]\n",
    "    \n",
    "    query_rating = \"\"\"\n",
    "        MATCH (r:Review)-[a:About]->(re:Restaurant)\n",
    "        WHERE re.cuisine = {term}\n",
    "        WITH re,COUNT(r) AS number,SUM(a.restaurant_sentiment) AS senti      \n",
    "        \n",
    "        RETURN re.name, senti/number AS average_senti\n",
    "        ORDER BY average_senti DESC\n",
    "\n",
    "    \"\"\"\n",
    "    \n",
    "    query_popularity = \"\"\"\n",
    "        MATCH (r:Review)-[a:About]->(re:Restaurant)\n",
    "        WHERE re.cuisine = {term}\n",
    "        WITH re,COUNT(r) AS number        \n",
    "        RETURN re.name,number\n",
    "        ORDER BY number DESC\n",
    "\n",
    "    \"\"\"\n",
    "    if sort == 'number_of_reviews':\n",
    "        query = query_popularity\n",
    "    \n",
    "    if sort == 'rating':\n",
    "        query = query_rating\n",
    "        \n",
    "    result = graph.run(query, term=text).data()\n",
    "    if result == []:\n",
    "        return ['No records found']\n",
    "    else: \n",
    "        return result\n",
    "    \n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
