{"Xing Wei Chua": {
        "Link": "/@the_xw",
        "Level": "10",
        "NumReviews": "4917",
        "Badge": "Tm",
        "Lists": {
            "Chronicles of Cheese Tea": {
                "Link": "/list/512927/chronicles-of-cheese-tea",
                "Categories": {
                    "Desserts": "/categories/sg/desserts"
                }
            },
            "Chinese Delights": {
                "Link": "/list/506981/chinese-delights"
            },
            "Open Stove 2017 @ Timbre+": {
                "Link": "/list/506872/open-stove-2017-timbre"
            },
            "Singapore Food Festival 2016 - Open Stoves @ Timbre+": {
                "Link": "/list/496289/singapore-food-festival-2016-open-stoves-timbre"
            },
            "Spice, And Everything Nice": {
                "Link": "/list/496249/spice-and-everything-nice",
                "Categories": {
                    "Indian": "/categories/sg/indian"
                }
            },
            "Tasty Tastemaker Tour (28th May 2016)": {
                "Link": "/list/494096/tasty-tastemaker-tour-28th-may-2016",
                "Categories": {
                    "Interesting": "/categories/sg/interesting",
                    "Breakfast & Brunch": "/categories/sg/breakfast-and-brunch",
                    "Cafes & Coffee": "/categories/sg/cafes-and-coffee"
                }
            },
            "Burgs 'n' Rolls": {
                "Link": "/list/492007/burgs-n-rolls",
                "Categories": {
                    "Burgers": "/categories/sg/burgers",
                    "Western": "/categories/sg/western"
                }
            },
            "Spaghett-ular": {
                "Link": "/list/492005/spaghett-ular",
                "Categories": {
                    "Italian": "/categories/sg/italian",
                    "Pasta": "/categories/sg/pasta"
                }
            }
        },
        "Reviews": {
            "2pcs Chicken (Spicy Sauce)": {
                "RestaurantName": "\nOtoke Chicken\n",
                "RestaurantAddress": "\n, Singapore\n",
                "Review": "Gave Otoke Chicken at Asian Food Mall in Lucky Plaza a try recently; a new Korean fried chicken stall which gives a slight impression of being a 4Fingers Crispy Chicken spinoff given the packaging of the paper cups here. A little odd considering how it's located beside Jollibee within the same food court, but Otoke Chicken works for those who are looking for a sauced-up (quite literally) fried chicken treat. \nLiked how the fried chicken here was not too greasy here; the chicken being pretty tender and succulent. Opting for the Spicy Sauce, the Spicy Sauce comes pretty piquant and is not shy in terms of its spiciness — the heat being pretty prominent and lingers around which works well for spicy lovers; all that whilst carrying a slight savoury and sweet note of sweet soy typical of Korean fried chicken. While the fries come with a generous seasoning of honey soy powder for flavour, we were not fans of the soft fries; whilst not being drenched in oil, it was peculiarly limp and soggy within — would have preferred some crispness on the exterior and fluffiness within. That being said, it's not a bad eat; in fact a pretty decent option to go for — perhaps albeit of a bad location for how it may draw some unfair comparisons with its more famous neighbour, but it satiates the Korean fried chicken cravings just about right at an individual-friendly size and a reasonable price."
            },
            "Buttermilk Waffles with Chng Tng Sorbet and Sea Salt Gula Melaka": {
                "RestaurantName": "\nCreamier (Toa Payoh)\n",
                "RestaurantAddress": "\n131 Lorong 1 Toa Payoh, Singapore\n",
                "Review": "Its great to see Creamier back in Toa Payoh again; not only that, but just a stone's throw away from their former location at Blk 128 Lorong 1 Toa Payoh. Moving into a new HDB estate just across the road, Creamier is all that we remembered — that includes the small shop space (albeit more spacious considering how there seems to be a bigger gap in between tables now for more privacy; just less claustrophobic than before) and the long queues snaking within the shop itself. \nHad to give the Buttermilk Waffles a go; pretty much the go-to waffle that we have always known, though this time sitting atop a disposable plate — the waffle is crisp on the outside and plush in the inside, wafting of a buttermilk fragrance while the chocolate sauce and maple syrup helps to elevate the aroma even further. Going for the Chng Tng Sorbet, the sorbet is churned with dried longan for light and refreshing note reminiscent of the local dessert with a bite; a contrast to the classic Sea Salt Gula Melaka which carries a deep sweetness with a balanced note of saltishness — simple yet satisfying, and a flavour that is well-associated with the brand these days. Still the spot to head to for satisfying ice-cream and waffles in the heartlands — that is considering if one exercises some patience and is able to make a little sacrifice to comfort whilst dining in"
            },
            "Chicken Souvlaki": {
                "RestaurantName": "\nPano Kato Grill, Pizza & Deli\n",
                "RestaurantAddress": "\n163 Tanglin Road, Singapore\n",
                "Review": "Two Giant Skewers with Chicken Thigh, served with fresh rosemary, caramelised red shallots, roasted garlic, and a wedge of lemon. From the new Pano Kato Grill, Pizza & Deli at Tanglin Mall, opened by the same folks behind House of AnLi which is better known for their Aussie-style brunches and contemporary cuisine. \nThis is off their Josper Grill menu; essentially meats sourced from Australia that is grilled using charcoal and wood from their Josper oven. Really enjoyed the Chicken Souvlaki here; the greens being even more amazing than the meat itself. Don't get me wrong; the chicken is really lovely on its own; the lack of seasoning helps to bring out that smoky, charred notes from that cooking process, but the greens are immensely juicy yet carrying a myriad of flavours from the distinct notes of the capsicums to the crunchiness of the onions. The onion bulbs and roasted garlic were truly amazing however; all sorts of juicy yet soft to the bite — absolutely wonderful. Needless to say, whilst we only had just a small selection of the sides and the desserts, we would certainly be back for more; the food, the vibes — all the things I would want to sink into on a leisurely weekend."
            },
            "Bacon Kedgeree": {
                "RestaurantName": "\nAtlas Coffeehouse\n",
                "RestaurantAddress": "\n6 Duke's Road, Singapore\n",
                "Review": "Bacon Curried Rice, Raisins, Tomato Basil Paste, Organic Jammy Egg, Caramelised Onion, Sour Cream. One of the new items available at Atlas Coffeehouse which had since reopened after an extensive renovation which carries a different look from before. \nEssentially almost akin to Pineapple Fried Rice spiked with chunks of bacon all over, the rice comes slightly sweet yet with a hint of curry spice, made savoury from the bits of bacon that speckled throughout the entire bowl. The Organic Jammy Egg is done to a texture where the egg yolk is a little hardened but still creamy, though not oozy and flowy like a typical sous-vide egg; I would have probably preferred having it sous-vide or molten to allow the yolk to better mix into the rice for better flavour. That being said, the caramelised onions were extremely on-point with its sweetness — a very distinct note that works extremely well with the rice while the sour cream, though a little unnecessary for me, does help in providing a slightly neutral flavour yet adding some creaminess into the dish. Everything is still done as per standards familiar to Atlas Coffeehouse, Colombus Coffee Co., and Lunar Coffee Brewers; pretty excited to give the other new items a go another time."
            },
            "Ngoh Hiang": {
                "RestaurantName": "\nBedok Bak Chor Mee\n",
                "RestaurantAddress": "\n13 Circular Road, Singapore\n",
                "Review": "From the new Bedok Bak Chor Mee at Circular Road; a new establishment that is situated just a short distance away from Yan Kee Noodle House and The Salted Plum that specialises in serving up \"Bedok-style\" Bak Chor Mee. Apart from serving up Bak Chor Mee in both dry and soup options, Bedok Bak Chor Mee also serves up other sides, as well Ngoh Hiang and a rotating menu of local desserts. \nGoing with the Crispy Prawn Cracker, Yam Roll, Water Chestnut Cake and QQ Pork Sausage, one could tell how the ingredients are pretty fresh and fried quite well; none of the fried fritters felt overly greasy nor soaked up in oil — items were pretty crisp whilst the meatier items come with a good bite and pretty juicy. The accompanying chili was also great; a good balance of sweetness and mild spiciness that provides a contrast of flavours. Something which is great to share around the table with the Bak Chor Mee that is to be ordered here."
            },
            "Earl Grey Lavender Croissant with Toasted Hazelnuts and Cream Cheese Filling": {
                "RestaurantName": "\nBrawn & Brains Coffee (Guillemard)\n",
                "RestaurantAddress": "\n100 Guillemard Road, Singapore\n",
                "Review": "Have had the original Earl Grey Lavender Croissant with Toasted Hazelnuts for quite a while now, so this new rendition (which I already had twice; once at East Coast Road and the other time at Guillemard) was certainly a refreshing change. Now the same airy croissant that perfumes of the floral notes now come with an cream cheese filling — the filling isn't particularly heavy; one would get a light tinge of tartness whilst the cream cheese helps add a soft and creamy texture provides a contrast of textures which seems fitting to the croissant. Spiked with a little bit of the Earl Grey Lavender, the Earl Grey Lavender Cream Cheese also helps to elevate those floral notes even further from the sugar glazing; pretty lovely indeed."
            },
            "Original Mee Pok": {
                "RestaurantName": "\nHosay Mee Pok (Bedok)\n",
                "RestaurantAddress": "\n204 Bedok North Street 1, Singapore\n",
                "Review": "Wasn't intending to dine here at the first place, but ended up here somehow after a failed attempt of having Dim Sum elsewhere. Must say that this was actually worth the detour (or even the trip); the Mee Pok here is well-executed considering the many elements that went into the bowl. Really liked how the noodles gave a good bite; pretty much \"al-dente\" whilst coming with a lot of goodies such as pig liver, pork slices, fried beancurd skin, minced pork and even clams for just $4.00. The sauce was great for the most part; a balance in between bring vinegary and spicy, while the clam is pretty fresh and a great addition. The inclusion of fried beancurd skin was a hit with me too; whilst being a replacement for the crispy pork lard, it's definitely less greasy than what it replaces — very delicious on its own. Would totally opt for the Signature Mee Pok next time; coming with even more goodies like scallops and prawn paste, it sounds pretty worth the price of $6.00 that it commands."
            },
            "Salmon Pot": {
                "RestaurantName": "\nFarmAppetit\n",
                "RestaurantAddress": "\n200 Pandan Gardens, Singapore\n",
                "Review": "Crispy Brown Rice Crusted Salmon, Seafood Miso Tamarind Broth infused with Dried Chili, Daikon, Bamboo Shoot, Braised Eggplant, Leek Tempura. From FarmAppetit; a new establishment which had taken over the former premises of KEK Seafood Pandan Gardens. \nServing up pretty much Western fare with their very own twist, this item comes with a Japanese influence and a very slight local twist. Really enjoyed the Seafood Miso Tamarind Broth; a savoury and light broth that was pretty clean in terms of flavour and easy to have — went well with the flavours of the salmon which was fresh and came with a brown rice crust that gives it a good crunch. Other items such as the Daikon provides a soft bite, while the bamboo shoot gives a crunch; the Leek Tempura also giving a good bite whilst being crisp and all. Pretty liked how this dish was just something that warms up the heart; very clean notes yet with a variety of textures. A little pricey considering the neighbourhood it is located at, but a place that is certainly a hard find in this area of Singapore."
            },
            "1910 Coffee and Chocolate Croiaaant": {
                "RestaurantName": "\nBacha Coffee\n",
                "RestaurantAddress": "\n2 Orchard Turn, Singapore\n",
                "Review": "From Bacha Coffee, a new coffee room at ION Orchard which had taken the space opposite Nespresso on Level 1; a space that had been vacant for quite a while which saw various plans for quite a number of F&B establishments that did not turn into fruition. A brand that hails from Morocco, the coffee room at ION Orchard is their very first of such concepts internationally. \nServing up Moroccan dishes for the hot food selection and a wide variety of viennoiseries, pastries and desserts, the 1910 Coffee and Chocolate Croissants come in a portion of two for a serving. Coming with coffee flower honey on the side, the croissants came aptly flaky and buttery; the infusion of coffee helps to add a light hint of earthiness and roastinese to the croissant, while a knob of chocolate helps to provide a sweetness to the pastry. Sprinkled with sea salt over the top, the sea salt adds on to the butteriness, further enhancing those flavours. The coffee flower honey is not quite required here, considering how the chocolate helps to provide some sweetness to the croissants — that being said, it still adds a nice sticky and gritty texture similar to raw honey with a floral sweetness that is absolutely alluring. A spot that would most probably be a tai-tai hangout for a pot of coffee after a day's worth of shopping — the TWG-esque Moroccan vibes with the classical music here is what I absolutely dig, with the impeccable service which is just very much on point."
            },
            "Classic Mac & Cheese": {
                "RestaurantName": "\nAshes Burnnit! (Golden Mile Food Centre)\n",
                "RestaurantAddress": "\n505 Beach Road, Singapore\n",
                "Review": "From Ashes Burnnit! at Golden Mile Food Centre, a Muslim-run stall which had recently moved into the unit that Burgs by Project Warung had previously occupied in the food centre. \nServing up affordable burgers, Mac & Cheese and Frossaints to the masses, the Classic Mac & Cheese here is pretty much a steal at S$5.00. Coming with their signature Mac & Cheese sauce, mix salad, garlic breadcrumbs and mozzarella cheese, this would appease the younger folks and hipsters alike with its cheesiness — the sauce carries a flavour similar to that of nacho cheese sauce; the flavours more tuned down here so it does not get too jelak throughout the serving, while the macaroni provides a good chew. The melted mozzarella cheese atop helps to provide a oozy, stretchy and stringy texture, while the garlic breadcrumbs provide a slight crispness to the entire deal. The greens attempt to help to balance things out a little, giving a good break in between spoonfuls of the Classic Mac & Cheese — did not find it absolutely necessary to include the Goma dressing, but certainly good to have. A pretty decent item to consider sharing at the table for a light bite, or something to have individually for a decently-sized sinful treat at the hawker centre."
            },
            "Seared Atlantic Seabass with Lentils": {
                "RestaurantName": "\nManna (City Gate)\n",
                "RestaurantAddress": "\n371 Beach Road, Singapore\n",
                "Review": "Seared Atlantic Seabass, Braised Cabbage, String Beans with Lettuce, White Wine Sauce. \nFrom the newly-opened Manna at City Gate along Beach Road; a stone's throw away from Sultan Plaza and Golden Mile Food Centre. Serving up a variety of Western cuisine (some carrying a local influence), the Seared Atlantic Seabass with Lentils was an item that we felt was pretty decent for its price of S$16.00. \nComing with a crisp skin from the searing, the fish was still considerably flaky with some moisture being locked within; its flavour enhanced by the white wine sauce which was all savoury and buttery, while the accompanying greens such as the braised cabbage provides a familiar, soft crunch providing the local infusion for this item. The long beans further helps to provide more texture, while the lentils gave a soft bite to even things out. A pretty decent item to go for here; given how Manna is decked out, it does make for a good spot for a relaxed date or casual lunches in the day with rattan and wood furnishings with the sunlight pouring in from the full length windows on the facade — a spot that is worth considering to dine at when in the area."
            },
            "Smokin' Sally": {
                "RestaurantName": "\n Onalu\n",
                "RestaurantAddress": "\n60 Stamford Road, Singapore\n",
                "Review": "Smoked Salmon, Fresh Spinach, Chives Cream Cheese, Dill and Capers. Dropped by Onalu, which had recently opened its doors at Singapore Management University, School of Accountancy replacing Kraftwich by Swissbake which previously sat in its premises. Offering SMU students and staff with a choice for healthy food, Onalu serves up a variety of smoothie bowls (i.e. Acai Bowls) and Bagel-wiches. \nOpting for the Onion Bagel with our order (other choices of bagels include Sesame Bagel and Plain Bagel), the Smokin' Sally is a great choice for a classic combination of condiments with their own twist. Really enjoyed the bagel for how it carries a firm bite without feeling overly dense nor heavy; the onion shallots speckled on the exterior providing a slight garlicky hint of flavour which went really well with the entire Bagel-wich. Unlike other similar bagel-wiches served at other joints, the cream cheese spread is in no way heavy or overwhelmimg; the infusion of chives help to keep things light and refreshing, neutralising and cutting away any of that jelak feel usually associated with cream cheese whilst the creamy texture that binds all of the elements together. The smoked salmon is fresh, providing the bagel-wich with a distinct brininess of cured fish that is not overpowering in terms of saltishness. Overall, a very well put-together package altogether; a well-executed item that's fairly reasonable for its price point (i.e. $8.90 for public; a dollar off for SMU students and staff). Certainly lucky to be a student these days with such quality and value-for-money locations opening on campus worth the occasional splurge — all that without the sin."
            }
        },
        "Wishlist": {
            "Broadway (Marsiling)": "/broadway-cofeshop?bp_ref=%2F%40the_xw%2Fwishlist",
            "Junior Kuppanna Restaurant": "/junior-kuppanna?bp_ref=%2F%40the_xw%2Fwishlist",
            "Alison Eating House": "/alison-eating-house?bp_ref=%2F%40the_xw%2Fwishlist",
            "Boyett's Grill": "/boyetts-grill?bp_ref=%2F%40the_xw%2Fwishlist",
            "The Dempsey Cookhouse & Bar": "/the-dempsey-cookhouse-bar?bp_ref=%2F%40the_xw%2Fwishlist",
            "吃Western": "/western?bp_ref=%2F%40the_xw%2Fwishlist",
            "Po": "/po-restaurant?bp_ref=%2F%40the_xw%2Fwishlist",
            "Hwang Sil Korean-Chinese Restaurant": "/hwangsil?bp_ref=%2F%40the_xw%2Fwishlist",
            "The Thai Chef": "/the-thai-chef?bp_ref=%2F%40the_xw%2Fwishlist",
            "Pepper Bowl (Amoy Street Food Centre)": "/pepper-bowl?bp_ref=%2F%40the_xw%2Fwishlist"
        }
    }}